01_SodShockTube/shockTube_rhoEnergyFoam/system/start/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
    //default         backward;
    //default         CrankNicolson 0.7;	//0 - 0.7 - 1
}

gradSchemes
{
    //default         Gauss linear;
    //default         cellMDLimited Gauss linear 1;
    default         cellLimited Gauss linear 1;
    //default         cellLimited Gauss pointLinear 1;
    //default         leastSquares;
    //default         cellLimited leastSquares 1;
    //default         cellMDLimited leastSquares 1;

    //default         cellLimited<cubic> 1.5 Gauss linear 1;		//Cubic gradient limiter
    //default         cellLimited<Venkatakrishnan> leastSquares 1;	//Venkatakrishnan gradient limiter

    //grad(U)         cellLimited Gauss linear 1;
    //grad(p)         cellLimited Gauss linear 0.33333;
    //grad(h)         cellLimited Gauss linear 0.5;
}

divSchemes
{
    default         none;

    //div(phi,U)      Gauss linearUpwind default;
    div(phi,U)      Gauss linearUpwindV default;
    //div(phi,U)      Gauss linearUpwind grad(U);
    //div(phi,U)      Gauss linearUpwindV grad(U);

    //div(phi,U)      Gauss linear;
    //div(phi,U)      Gauss upwind;

    //div(phi,U)      Gauss LUST default;

    //div(phi,U)      Gauss vanLeer;
    //div(phi,U)      Gauss vanLeerV;

    //div(phi,U)      Gauss Minmod;
    //div(phi,U)      Gauss MinmodV;

    //div(phi,U)      Gauss QUICK;
    //div(phi,U)      Gauss SuperBee;

/*
    div(phid,p)     Gauss limitedLinear 1;
    div(phiv,p)     Gauss limitedLinear 1;
    div(phi,K)      Gauss limitedLinear 1;
    div(phi,e)      Gauss limitedLinear 1;
*/

    energy1 LUST default;
    energy2 linearUpwind default;
    energy3 limitedLinear 1;
    energy4 Minmod;
    energy5 linear;
    energy6 upwind;

    div(phi,(p|rho)) Gauss linearUpwind default;

    //for sensibleInternalEnergy formulation - e
    div(phi,e)      Gauss $energy2;
    div(phi,K)      Gauss $energy2;
    div(phid,p)     Gauss $energy2;

    //for sensibleEnthalpy formulation - h
    //div(phi,h)      Gauss $energy2;
    //div(phi,K)      Gauss $energy2;
    //div(phid,p)     Gauss $energy2;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear 1;
}

laplacianSchemes
{
    //default         Gauss linear uncorrected;
    //default         Gauss linear orthogonal;
    //default         Gauss linear corrected;
    default         Gauss linear limited 1;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    //default         uncorrected;
    //default         orthogonal;
    //default         corrected;
    default         limited 1;
}

// ************************************************************************* //
